In [14]:
import pandas as pd
import numpy as np

In [3]:
print(pd.__version__)

2.2.2

In [5]:
data = {
    'course' : ["Python", "CPP", "Java"],
    'mentor' : ["ABC", "LMN", "XYZ"]
}
newDataFrame = pd.DataFrame(data)
print(newDataFrame)

   course mentor
0  Python    ABC
1     CPP    LMN
2    Java    XYZ

# Series in Pandas

In [10]:
s = pd.Series([10,20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [20]:
s = pd.Series([10,20, 30, 40, np.nan, 50, 60])
print(s)

0    10.0
1    20.0
2    30.0
3    40.0
4     NaN
5    50.0
6    60.0
dtype: float64

In [24]:
# Reading data from series
s[1]

20.0

**Using custom index**

In [34]:
mentor = ["Rajat", "Shyam", "ABC"]
series = pd.Series(mentor, index = ["Python", "CPP", "Java"])
print(series)

Python    Rajat
CPP       Shyam
Java        ABC
dtype: object

**Create a series from python dict**

In [41]:
courses = {
    "Python": "Rajat",
    "CPP" : "Shyam",
    "Java" : "ABC"
}
series = pd.Series(courses)
print(series)

Python    Rajat
CPP       Shyam
Java        ABC
dtype: object

In [47]:
courses = {
    "Python": "Rajat",
    "CPP" : "Shyam",
    "Java" : "ABC"
}
series = pd.Series(courses, index = ["Python", "CPP"])
print(series)

Python    Rajat
CPP       Shyam
dtype: object

**Create a series from nd array**

In [50]:
array = np.array([10,20,30,40])
series = pd.Series(array)
print(series)

0    10
1    20
2    30
3    40
dtype: int32

**Series from scaler value**

In [171]:
series = pd.Series(5, index = ['A', 'B', 'C'])
print(series)

A    5
B    5
C    5
dtype: int64

## Dataframe

In [ ]:
data = {
    'first_column': ['first_value', 'second_value' ...],
    'second_column' : ['first_value', 'second_value' ...],
    ....
    ...
}

In [58]:
data = {
    'product_name': ['laptop', 'printer', 'tablet', 'desk', 'chair'],
    'price': [1200, 150, 300, 450, 200]
}

df = pd.DataFrame(data)
print(df)

  product_name  price
0       laptop   1200
1      printer    150
2       tablet    300
3         desk    450
4        chair    200

**Using custom index in dataframe**

In [62]:
data = {
    'product_name': ['laptop', 'printer', 'tablet', 'desk', 'chair'],
    'price': [1200, 150, 300, 450, 200]
}

df = pd.DataFrame(data, index = ['value_1', 'value_2', 'value_3', 'value_4', 'value_5'])
print(df)

        product_name  price
value_1       laptop   1200
value_2      printer    150
value_3       tablet    300
value_4         desk    450
value_5        chair    200

In [64]:
arr = ['Mango', 'Apple', "Banana"]
df = pd.DataFrame(arr)
print(df)

        0
0   Mango
1   Apple
2  Banana

In [68]:
arr = [['Mango', 'Apple', "Banana"], ['abc', 'mmm', 'xyz']]
df = pd.DataFrame(arr)
print(df)

       0      1       2
0  Mango  Apple  Banana
1    abc    mmm     xyz

In [70]:
# from nd array
arr = np.array([10, 20, 30, 40])
df = pd.DataFrame(arr)
print(df)

    0
0  10
1  20
2  30
3  40

In [74]:
# from nd array

arr = np.array([[10, 20, 30, 40],[1,2,3,4]])
df = pd.DataFrame(arr)
print(df)

    0   1   2   3
0  10  20  30  40
1   1   2   3   4

In [78]:
arr = [10, 20, 30, 40]
series = pd.Series(arr)
df = pd.DataFrame(series)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [84]:
dataset = [
    {'course': "Python", "fees": 2000, "mentor": "Rajat", 'rating': 9},
    {'course': "CPP", "fees": 2500, "mentor": "Shyam"},
    {'course': "Java", "fees": 2300, "mentor": 'CAA'}
]
df = pd.DataFrame(dataset)
print(df)

   course  fees mentor  rating
0  Python  2000  Rajat     9.0
1     CPP  2500  Shyam     NaN
2    Java  2300    CAA     NaN

In [141]:
dataset = {
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", 'test', 'train']),
    "F": 'foo',
    'G': [10,20,30,40]
}
df = pd.DataFrame(dataset)
print(df)
print(df.dtypes)

     A          B    C  D      E    F   G
0  1.0 2013-01-02  1.0  3   test  foo  10
1  1.0 2013-01-02  1.0  3  train  foo  20
2  1.0 2013-01-02  1.0  3   test  foo  30
3  1.0 2013-01-02  1.0  3  train  foo  40
A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
G            int64
dtype: object

In [101]:
dataset = [
    {'course': "Python", "fees": 2000, "mentor": "Rajat", 'rating': 9},
    {'course': "CPP", "fees": 2500, "mentor": "Shyam"},
    {'course': "Java", "fees": 2300, "mentor": 'CAA'}
]
df = pd.DataFrame(dataset)

newDf = df[['course', 'fees']].copy()
print(newDf)

   course  fees
0  Python  2000
1     CPP  2500
2    Java  2300

In [109]:
dataset = [
    {'course': "Python", "fees": 2000, "mentor": "Rajat", 'rating': 9},
    {'course': "CPP", "fees": 2500, "mentor": "Shyam"},
    {'course': "Java", "fees": 2300, "mentor": 'CAA'}
]
df = pd.DataFrame(dataset)
print(df)
print("***********************************")
print(df['course'])

   course  fees mentor  rating
0  Python  2000  Rajat     9.0
1     CPP  2500  Shyam     NaN
2    Java  2300    CAA     NaN
***********************************
0    Python
1       CPP
2      Java
Name: course, dtype: object

**new dataframe with 1 coloumn drop**

In [119]:
dataset = [
    {'course': "Python", "fees": 2000, "mentor": "Rajat", 'rating': 9},
    {'course': "CPP", "fees": 2500, "mentor": "Shyam"},
    {'course': "Java", "fees": 2300, "mentor": 'CAA'}
]
df = pd.DataFrame(dataset)
print(df)
print("*************************")
newdf = df.drop('rating', axis = 1)
print(newdf)

   course  fees mentor  rating
0  Python  2000  Rajat     9.0
1     CPP  2500  Shyam     NaN
2    Java  2300    CAA     NaN
*************************
   course  fees mentor
0  Python  2000  Rajat
1     CPP  2500  Shyam
2    Java  2300    CAA

In [125]:
dataset = [
    {'course': "Python", "fees": 2000, "mentor": "Rajat", 'rating': 9},
    {'course': "CPP", "fees": 2500, "mentor": "Shyam"},
    {'course': "Java", "fees": 2300, "mentor": 'CAA'}
]
df = pd.DataFrame(dataset)
print(df)
print("*************************")
df.drop('rating', axis = 1, inplace = True)
print(df)

   course  fees mentor  rating
0  Python  2000  Rajat     9.0
1     CPP  2500  Shyam     NaN
2    Java  2300    CAA     NaN
*************************
   course  fees mentor
0  Python  2000  Rajat
1     CPP  2500  Shyam
2    Java  2300    CAA

In [131]:
dataset = [
    {'course': "Python", "fees": 2000, "mentor": "Rajat", 'rating': 9},
    {'course': "CPP", "fees": 2500, "mentor": "Shyam"},
    {'course': "Java", "fees": 2300, "mentor": 'CAA'}
]
df = pd.DataFrame(dataset)
print(df)
print("*************************")
df.drop(index = 2, inplace = True)
print(df)

   course  fees mentor  rating
0  Python  2000  Rajat     9.0
1     CPP  2500  Shyam     NaN
2    Java  2300    CAA     NaN
*************************
   course  fees mentor  rating
0  Python  2000  Rajat     9.0
1     CPP  2500  Shyam     NaN

In [139]:
result = pd.date_range("20130101", periods = 6)
print(result)
df = pd.DataFrame(np.random.randn(6, 4), index = result, columns=['A', 'B', 'C', 'D'])
print(df)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
                   A         B         C         D
2013-01-01  0.524564  0.097045  0.841726  0.672078
2013-01-02  0.703043 -0.015897  0.111869 -0.679297
2013-01-03 -0.878303 -0.095082  1.881875 -0.274086
2013-01-04 -1.754194 -0.768674  0.715855  0.075581
2013-01-05 -0.155475 -0.215556  0.848043  0.755051
2013-01-06 -1.077531 -1.436659  1.235165  0.803159

In [143]:
data = {
    'product_name': ['laptop', 'printer', 'tablet', 'desk', 'chair'],
    'price': [1200, 150, 300, 450, 200]
}
df = pd.DataFrame(data)
max_price = df['price'].max()
print(max_price)

1200

In [151]:
dataframe = pd.DataFrame({
    'teamA': [15, 20, 19],
    'teamB' : [12, 20, 16],
    'teamC' : [16, 17, 18]
})
newdf = dataframe.add(18)
print(newdf)

   teamA  teamB  teamC
0     33     30     34
1     38     38     35
2     37     34     36

In [167]:
dataframe1 = pd.DataFrame({
    'teamA': [15, 20, 19],
    'teamB' : [12, 20, 16],
    'teamC' : [16, 17, 18]
})
dataframe2 = pd.DataFrame({
    'teamA': [100, 120],
    'teamB' : [222, 120],
    'teamC' : [116, 117]
})
newdf = pd.concat([dataframe1, dataframe2])
# newdf = dataframe1.append(dataframe2)
print(newdf)

   teamA  teamB  teamC
0     15     12     16
1     20     20     17
2     19     16     18
0    100    222    116
1    120    120    117

In [181]:
newdf.head(10)

   teamA  teamB  teamC
0     15     12     16
1     20     20     17
2     19     16     18
0    100    222    116
1    120    120    117

In [185]:
newdf.tail(3)

   teamA  teamB  teamC
2     19     16     18
0    100    222    116
1    120    120    117

### CSV File

Name,Age,Department,Salary
John Doe,28,Engineering,70000
Jane Smith,34,Marketing,80000
Emily Davis,22,Sales,50000
Michael Brown,45,HR,90000
Jessica Wilson,30,Finance,75000

In [192]:
df = pd.read_csv('mydata.csv')
print(df)

             Name  Age   Department  Salary
0        John Doe   28  Engineering   70000
1      Jane Smith   34    Marketing   80000
2     Emily Davis   22        Sales   50000
3   Michael Brown   45           HR   90000
4  Jessica Wilson   30      Finance   75000

### JSON Format

```
[
    {
        "Name": "John Doe",
        "Age": 28,
        "Department": "Engineering",
        "Salary": 70000
    },
    {
        "Name": "Jane Smith",
        "Age": 34,
        "Department": "Marketing",
        "Salary": 80000
    },
    {
        "Name": "Emily Davis",
        "Age": 22,
        "Department": "Sales",
        "Salary": 50000
    },
    {
        "Name": "Michael Brown",
        "Age": 45,
        "Department": "HR",
        "Salary": 90000
    },
    {
        "Name": "Jessica Wilson",
        "Age": 30,
        "Department": "Finance",
        "Salary": 75000
    }
]

In [206]:
df = pd.read_json('myjson.json')
print(df)
df.to_csv('newfile.csv')

             Name  Age   Department  Salary
0        John Doe   28  Engineering   70000
1      Jane Smith   34    Marketing   80000
2     Emily Davis   22        Sales   50000
3   Michael Brown   45           HR   90000
4  Jessica Wilson   30      Finance   75000

## Data Cleaning

In [209]:
data = {
    'Name': ['Anna', 'Brian', 'Anna', 'David', np.nan],
    'Age': [29, 30, 29, 40, np.nan],
    'City': ['New York', 'Los Angeles', 'New York', np.nan, np.nan]
}

df = pd.DataFrame(data)
df.head()

    Name   Age         City
0   Anna  29.0     New York
1  Brian  30.0  Los Angeles
2   Anna  29.0     New York
3  David  40.0          NaN
4    NaN   NaN          NaN

In [215]:
# count number of nulll values in a dataframe
print(df.isnull().sum())

Name    1
Age     1
City    2
dtype: int64

In [217]:
newdf = df.dropna()
print(newdf)

    Name   Age         City
0   Anna  29.0     New York
1  Brian  30.0  Los Angeles
2   Anna  29.0     New York